# Администрирование Linux
## Root
Root игнорирует все ограничения ОС. 
## Права доступа
Каждый файл в Linux системах принадлежит одному пользователю и одной группе.
## Chmod 
Chmod используется для изменения прав доступа на чтение, запись и исполнение.
## suid, sgid и sticky bit
sgid аналогичен suid, но устанавливаются права группы - владельца файла. Также все файлы, создаваемые в каталоге с установленным sgid, будут получать идентификатор группы - владельца каталога, а не владельца файла.
sticky bit при использовании пользователь сможет удалить файл, только если будет является владельцем этого файла или владельцем каталога, в котором содержится файл.
suid даёт возможность на время выполнения файланепривилегированному пользователю получить права пользователя - владельца файла.
